Revit 2024 API
BuiltInFailures.SketchFailures.BentFabricSheetEmptySketch Property
 The bend profile requires at least one segment to be placed in a host. Click Continue to correct the profile or Click Quit sketching to exit the bend profile editor.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId BentFabricSheetEmptySketch { get; }
Visual Basic
Public Shared ReadOnly Property BentFabricSheetEmptySketch As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ BentFabricSheetEmptySketch {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.SketchFailures Class
Autodesk.Revit.DB Namespace